Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/zigbee/csc_sleep_touch/firmware/src/packs/WBZ351_DFP/component/cfg.h
#define CFG_CFGCON4_SOSC_CFG_Pos              _UINT32_(0)                                          /* (CFG_CFGCON4) SOSC Configuration Position */
#define CFG_CFGCON4_SOSC_CFG_Msk              (_UINT32_(0xFF) << CFG_CFGCON4_SOSC_CFG_Pos)         /* (CFG_CFGCON4) SOSC Configuration Mask */
#define CFG_CFGCON4_SOSC_CFG(value)           (CFG_CFGCON4_SOSC_CFG_Msk & (_UINT32_(value) << CFG_CFGCON4_SOSC_CFG_Pos)) /* Assigment of value for SOSC_CFG in the CFG_CFGCON4 register */
#define CFG_CFGCON4_RTCEVENT_SEL_Pos          _UINT32_(8)                                          /* (CFG_CFGCON4) RTC Event Selection Position */
#define CFG_CFGCON4_RTCEVENT_SEL_Msk          (_UINT32_(0x3) << CFG_CFGCON4_RTCEVENT_SEL_Pos)      /* (CFG_CFGCON4) RTC Event Selection Mask */
#define CFG_CFGCON4_RTCEVENT_SEL(value)       (CFG_CFGCON4_RTCEVENT_SEL_Msk & (_UINT32_(value) << CFG_CFGCON4_RTCEVENT_SEL_Pos)) /* Assigment of value for RTCEVENT_SEL in the CFG_CFGCON4 register */
#define CFG_CFGCON4_RTCEVENT_EN_Pos           _UINT32_(10)                                         /* (CFG_CFGCON4) Pad Output Enable for MCHP legacy RTC event output Position */
#define CFG_CFGCON4_RTCEVENT_EN_Msk           (_UINT32_(0x1) << CFG_CFGCON4_RTCEVENT_EN_Pos)       /* (CFG_CFGCON4) Pad Output Enable for MCHP legacy RTC event output Mask */
#define CFG_CFGCON4_RTCEVENT_EN(value)        (CFG_CFGCON4_RTCEVENT_EN_Msk & (_UINT32_(value) << CFG_CFGCON4_RTCEVENT_EN_Pos)) /* Assigment of value for RTCEVENT_EN in the CFG_CFGCON4 register */
#define CFG_CFGCON4_VBKP_1KCSEL_Pos           _UINT32_(11)                                         /* (CFG_CFGCON4) VDDBUKPCORE LPCLK Clock Selection Position */
#define CFG_CFGCON4_VBKP_1KCSEL_Msk           (_UINT32_(0x1) << CFG_CFGCON4_VBKP_1KCSEL_Pos)       /* (CFG_CFGCON4) VDDBUKPCORE LPCLK Clock Selection Mask */
#define CFG_CFGCON4_VBKP_1KCSEL(value)        (CFG_CFGCON4_VBKP_1KCSEL_Msk & (_UINT32_(value) << CFG_CFGCON4_VBKP_1KCSEL_Pos)) /* Assigment of value for VBKP_1KCSEL in the CFG_CFGCON4 register */
#define CFG_CFGCON4_VBKP_32KCSEL_Pos          _UINT32_(12)                                         /* (CFG_CFGCON4) VDDBUKPCORE 32KHz clock source selection Position */
#define CFG_CFGCON4_VBKP_32KCSEL_Msk          (_UINT32_(0x3) << CFG_CFGCON4_VBKP_32KCSEL_Pos)      /* (CFG_CFGCON4) VDDBUKPCORE 32KHz clock source selection Mask */
#define CFG_CFGCON4_VBKP_32KCSEL(value)       (CFG_CFGCON4_VBKP_32KCSEL_Msk & (_UINT32_(value) << CFG_CFGCON4_VBKP_32KCSEL_Pos)) /* Assigment of value for VBKP_32KCSEL in the CFG_CFGCON4 register */
#define CFG_CFGCON4_VBKP_DIVSEL_Pos           _UINT32_(14)                                         /* (CFG_CFGCON4) VDDBUKPCORE LPCLK Clock Divider Selection Position */
#define CFG_CFGCON4_VBKP_DIVSEL_Msk           (_UINT32_(0x1) << CFG_CFGCON4_VBKP_DIVSEL_Pos)       /* (CFG_CFGCON4) VDDBUKPCORE LPCLK Clock Divider Selection Mask */
#define CFG_CFGCON4_VBKP_DIVSEL(value)        (CFG_CFGCON4_VBKP_DIVSEL_Msk & (_UINT32_(value) << CFG_CFGCON4_VBKP_DIVSEL_Pos)) /* Assigment of value for VBKP_DIVSEL in the CFG_CFGCON4 register */
#define CFG_CFGCON4_LPCLK_MOD_Pos             _UINT32_(15)                                         /* (CFG_CFGCON4) LPCLK modifier in counter/delay mode Position */
#define CFG_CFGCON4_LPCLK_MOD_Msk             (_UINT32_(0x1) << CFG_CFGCON4_LPCLK_MOD_Pos)         /* (CFG_CFGCON4) LPCLK modifier in counter/delay mode Mask */
#define CFG_CFGCON4_LPCLK_MOD(value)          (CFG_CFGCON4_LPCLK_MOD_Msk & (_UINT32_(value) << CFG_CFGCON4_LPCLK_MOD_Pos)) /* Assigment of value for LPCLK_MOD in the CFG_CFGCON4 register */
#define CFG_CFGCON4_RTCEVTYPE_Pos             _UINT32_(16)                                         /* (CFG_CFGCON4) RTC Event Type Position */
#define CFG_CFGCON4_RTCEVTYPE_Msk             (_UINT32_(0x1) << CFG_CFGCON4_RTCEVTYPE_Pos)         /* (CFG_CFGCON4) RTC Event Type Mask */
#define CFG_CFGCON4_RTCEVTYPE(value)          (CFG_CFGCON4_RTCEVTYPE_Msk & (_UINT32_(value) << CFG_CFGCON4_RTCEVTYPE_Pos)) /* Assigment of value for RTCEVTYPE in the CFG_CFGCON4 register */
#define CFG_CFGCON4_CPEN_DLY_Pos              _UINT32_(17)                                         /* (CFG_CFGCON4) Charge-pump ready digital delay Position */
#define CFG_CFGCON4_CPEN_DLY_Msk              (_UINT32_(0x7) << CFG_CFGCON4_CPEN_DLY_Pos)          /* (CFG_CFGCON4) Charge-pump ready digital delay Mask */
#define CFG_CFGCON4_CPEN_DLY(value)           (CFG_CFGCON4_CPEN_DLY_Msk & (_UINT32_(value) << CFG_CFGCON4_CPEN_DLY_Pos)) /* Assigment of value for CPEN_DLY in the CFG_CFGCON4 register */
#define CFG_CFGCON4_DSZPBOREN_Pos             _UINT32_(20)                                         /* (CFG_CFGCON4) Deep Sleep Zero-Power BOR Enable Position */
#define CFG_CFGCON4_DSZPBOREN_Msk             (_UINT32_(0x1) << CFG_CFGCON4_DSZPBOREN_Pos)         /* (CFG_CFGCON4) Deep Sleep Zero-Power BOR Enable Mask */
#define CFG_CFGCON4_DSZPBOREN(value)          (CFG_CFGCON4_DSZPBOREN_Msk & (_UINT32_(value) << CFG_CFGCON4_DSZPBOREN_Pos)) /* Assigment of value for DSZPBOREN in the CFG_CFGCON4 register */
#define CFG_CFGCON4_DSWDTPS_Pos               _UINT32_(21)                                         /* (CFG_CFGCON4) Deep Sleep Watchdog Timer Postscale Select Position */
#define CFG_CFGCON4_DSWDTPS_Msk               (_UINT32_(0x1F) << CFG_CFGCON4_DSWDTPS_Pos)          /* (CFG_CFGCON4) Deep Sleep Watchdog Timer Postscale Select Mask */
#define CFG_CFGCON4_DSWDTPS(value)            (CFG_CFGCON4_DSWDTPS_Msk & (_UINT32_(value) << CFG_CFGCON4_DSWDTPS_Pos)) /* Assigment of value for DSWDTPS in the CFG_CFGCON4 register */
#define CFG_CFGCON4_DSWDTOSC_Pos              _UINT32_(26)                                         /* (CFG_CFGCON4) Deep Sleep Watchdog Timer Reference Clock Select Position */
#define CFG_CFGCON4_DSWDTOSC_Msk              (_UINT32_(0x1) << CFG_CFGCON4_DSWDTOSC_Pos)          /* (CFG_CFGCON4) Deep Sleep Watchdog Timer Reference Clock Select Mask */
#define CFG_CFGCON4_DSWDTOSC(value)           (CFG_CFGCON4_DSWDTOSC_Msk & (_UINT32_(value) << CFG_CFGCON4_DSWDTOSC_Pos)) /* Assigment of value for DSWDTOSC in the CFG_CFGCON4 register */
#define CFG_CFGCON4_DSWDTEN_Pos               _UINT32_(27)                                         /* (CFG_CFGCON4) Deep Sleep Watchdog Timer Enable Position */
#define CFG_CFGCON4_DSWDTEN_Msk               (_UINT32_(0x1) << CFG_CFGCON4_DSWDTEN_Pos)           /* (CFG_CFGCON4) Deep Sleep Watchdog Timer Enable Mask */
#define CFG_CFGCON4_DSWDTEN(value)            (CFG_CFGCON4_DSWDTEN_Msk & (_UINT32_(value) << CFG_CFGCON4_DSWDTEN_Pos)) /* Assigment of value for DSWDTEN in the CFG_CFGCON4 register */
#define CFG_CFGCON4_DSEN_Pos                  _UINT32_(28)                                         /* (CFG_CFGCON4) Deep Sleep Bit Enable Position */
#define CFG_CFGCON4_DSEN_Msk                  (_UINT32_(0x1) << CFG_CFGCON4_DSEN_Pos)              /* (CFG_CFGCON4) Deep Sleep Bit Enable Mask */
#define CFG_CFGCON4_DSEN(value)               (CFG_CFGCON4_DSEN_Msk & (_UINT32_(value) << CFG_CFGCON4_DSEN_Pos)) /* Assigment of value for DSEN in the CFG_CFGCON4 register */
#define CFG_CFGCON4_UVREGROVR_Pos             _UINT32_(29)                                         /* (CFG_CFGCON4) ULPVREG Retention Mode Override Position */
#define CFG_CFGCON4_UVREGROVR_Msk             (_UINT32_(0x1) << CFG_CFGCON4_UVREGROVR_Pos)         /* (CFG_CFGCON4) ULPVREG Retention Mode Override Mask */
#define CFG_CFGCON4_UVREGROVR(value)          (CFG_CFGCON4_UVREGROVR_Msk & (_UINT32_(value) << CFG_CFGCON4_UVREGROVR_Pos)) /* Assigment of value for UVREGROVR in the CFG_CFGCON4 register */
#define CFG_CFGCON4_LPOSCEN_Pos               _UINT32_(30)                                         /* (CFG_CFGCON4) Low Power (Secondary) Oscillator Enable Position */
#define CFG_CFGCON4_LPOSCEN_Msk               (_UINT32_(0x1) << CFG_CFGCON4_LPOSCEN_Pos)           /* (CFG_CFGCON4) Low Power (Secondary) Oscillator Enable Mask */
#define CFG_CFGCON4_LPOSCEN(value)            (CFG_CFGCON4_LPOSCEN_Msk & (_UINT32_(value) << CFG_CFGCON4_LPOSCEN_Pos)) /* Assigment of value for LPOSCEN in the CFG_CFGCON4 register */
#define CFG_CFGCON4_RTCNTM_CSEL_Pos           _UINT32_(31)                                         /* (CFG_CFGCON4) RTC Counter Mode Clock Select Position */
#define CFG_CFGCON4_RTCNTM_CSEL_Msk           (_UINT32_(0x1) << CFG_CFGCON4_RTCNTM_CSEL_Pos)       /* (CFG_CFGCON4) RTC Counter Mode Clock Select Mask */
#define CFG_CFGCON4_RTCNTM_CSEL(value)        (CFG_CFGCON4_RTCNTM_CSEL_Msk & (_UINT32_(value) << CFG_CFGCON4_RTCNTM_CSEL_Pos)) /* Assigment of value for RTCNTM_CSEL in the CFG_CFGCON4 register */
#define CFG_CFGCON4_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (CFG_CFGCON4) Register Mask  */


/* -------- CFG_CFGPGQOS : (CFG Offset: 0x50) (R/W 32)  -------- */
#define CFG_CFGPGQOS_RESETVALUE               _UINT32_(0xE044004C)                                 /*  (CFG_CFGPGQOS)   Reset Value */

#define CFG_CFGPGQOS_CPUPG_Pos                _UINT32_(0)                                          /* (CFG_CFGPGQOS) CPU (Code) Permission Group Position */
#define CFG_CFGPGQOS_CPUPG_Msk                (_UINT32_(0x3) << CFG_CFGPGQOS_CPUPG_Pos)            /* (CFG_CFGPGQOS) CPU (Code) Permission Group Mask */
#define CFG_CFGPGQOS_CPUPG(value)             (CFG_CFGPGQOS_CPUPG_Msk & (_UINT32_(value) << CFG_CFGPGQOS_CPUPG_Pos)) /* Assigment of value for CPUPG in the CFG_CFGPGQOS register */
#define CFG_CFGPGQOS_CPUQOS_Pos               _UINT32_(2)                                          /* (CFG_CFGPGQOS) CPU I/D and System Bus QOS Control Position */
#define CFG_CFGPGQOS_CPUQOS_Msk               (_UINT32_(0x3) << CFG_CFGPGQOS_CPUQOS_Pos)           /* (CFG_CFGPGQOS) CPU I/D and System Bus QOS Control Mask */
#define CFG_CFGPGQOS_CPUQOS(value)            (CFG_CFGPGQOS_CPUQOS_Msk & (_UINT32_(value) << CFG_CFGPGQOS_CPUQOS_Pos)) /* Assigment of value for CPUQOS in the CFG_CFGPGQOS register */
#define CFG_CFGPGQOS_DMAPG_Pos                _UINT32_(8)                                          /* (CFG_CFGPGQOS) DMA (Rd/Wr) Permission Group Position */
#define CFG_CFGPGQOS_DMAPG_Msk                (_UINT32_(0x3) << CFG_CFGPGQOS_DMAPG_Pos)            /* (CFG_CFGPGQOS) DMA (Rd/Wr) Permission Group Mask */
#define CFG_CFGPGQOS_DMAPG(value)             (CFG_CFGPGQOS_DMAPG_Msk & (_UINT32_(value) << CFG_CFGPGQOS_DMAPG_Pos)) /* Assigment of value for DMAPG in the CFG_CFGPGQOS register */
#define CFG_CFGPGQOS_DGISPIPG_Pos             _UINT32_(16)                                         /* (CFG_CFGPGQOS) ADC Controller Permission Group Position */
#define CFG_CFGPGQOS_DGISPIPG_Msk             (_UINT32_(0x3) << CFG_CFGPGQOS_DGISPIPG_Pos)         /* (CFG_CFGPGQOS) ADC Controller Permission Group Mask */
#define CFG_CFGPGQOS_DGISPIPG(value)          (CFG_CFGPGQOS_DGISPIPG_Msk & (_UINT32_(value) << CFG_CFGPGQOS_DGISPIPG_Pos)) /* Assigment of value for DGISPIPG in the CFG_CFGPGQOS register */
#define CFG_CFGPGQOS_DGISPIQOS_Pos            _UINT32_(18)                                         /* (CFG_CFGPGQOS) ADC Controller QOS Control Position */
#define CFG_CFGPGQOS_DGISPIQOS_Msk            (_UINT32_(0x3) << CFG_CFGPGQOS_DGISPIQOS_Pos)        /* (CFG_CFGPGQOS) ADC Controller QOS Control Mask */
#define CFG_CFGPGQOS_DGISPIQOS(value)         (CFG_CFGPGQOS_DGISPIQOS_Msk & (_UINT32_(value) << CFG_CFGPGQOS_DGISPIQOS_Pos)) /* Assigment of value for DGISPIQOS in the CFG_CFGPGQOS register */
#define CFG_CFGPGQOS_CRYPTOPG_Pos             _UINT32_(20)                                         /* (CFG_CFGPGQOS) Crypto Permission Group Position */
#define CFG_CFGPGQOS_CRYPTOPG_Msk             (_UINT32_(0x3) << CFG_CFGPGQOS_CRYPTOPG_Pos)         /* (CFG_CFGPGQOS) Crypto Permission Group Mask */
#define CFG_CFGPGQOS_CRYPTOPG(value)          (CFG_CFGPGQOS_CRYPTOPG_Msk & (_UINT32_(value) << CFG_CFGPGQOS_CRYPTOPG_Pos)) /* Assigment of value for CRYPTOPG in the CFG_CFGPGQOS register */
#define CFG_CFGPGQOS_CRYPTOQOS_Pos            _UINT32_(22)                                         /* (CFG_CFGPGQOS) Crypto QOS Control Position */
#define CFG_CFGPGQOS_CRYPTOQOS_Msk            (_UINT32_(0x3) << CFG_CFGPGQOS_CRYPTOQOS_Pos)        /* (CFG_CFGPGQOS) Crypto QOS Control Mask */
#define CFG_CFGPGQOS_CRYPTOQOS(value)         (CFG_CFGPGQOS_CRYPTOQOS_Msk & (_UINT32_(value) << CFG_CFGPGQOS_CRYPTOQOS_Pos)) /* Assigment of value for CRYPTOQOS in the CFG_CFGPGQOS register */
#define CFG_CFGPGQOS_DSUPG_Pos                _UINT32_(24)                                         /* (CFG_CFGPGQOS) DSU Permission Group Position */
#define CFG_CFGPGQOS_DSUPG_Msk                (_UINT32_(0x3) << CFG_CFGPGQOS_DSUPG_Pos)            /* (CFG_CFGPGQOS) DSU Permission Group Mask */
#define CFG_CFGPGQOS_DSUPG(value)             (CFG_CFGPGQOS_DSUPG_Msk & (_UINT32_(value) << CFG_CFGPGQOS_DSUPG_Pos)) /* Assigment of value for DSUPG in the CFG_CFGPGQOS register */
#define CFG_CFGPGQOS_FCQOS_Pos                _UINT32_(28)                                         /* (CFG_CFGPGQOS) FC Controller QOS Control Position */
#define CFG_CFGPGQOS_FCQOS_Msk                (_UINT32_(0x3) << CFG_CFGPGQOS_FCQOS_Pos)            /* (CFG_CFGPGQOS) FC Controller QOS Control Mask */
#define CFG_CFGPGQOS_FCQOS(value)             (CFG_CFGPGQOS_FCQOS_Msk & (_UINT32_(value) << CFG_CFGPGQOS_FCQOS_Pos)) /* Assigment of value for FCQOS in the CFG_CFGPGQOS register */
#define CFG_CFGPGQOS_WISIBQOS_Pos             _UINT32_(30)                                         /* (CFG_CFGPGQOS) Wireless SIB QOS Control Position */
#define CFG_CFGPGQOS_WISIBQOS_Msk             (_UINT32_(0x3) << CFG_CFGPGQOS_WISIBQOS_Pos)         /* (CFG_CFGPGQOS) Wireless SIB QOS Control Mask */
#define CFG_CFGPGQOS_WISIBQOS(value)          (CFG_CFGPGQOS_WISIBQOS_Msk & (_UINT32_(value) << CFG_CFGPGQOS_WISIBQOS_Pos)) /* Assigment of value for WISIBQOS in the CFG_CFGPGQOS register */
#define CFG_CFGPGQOS_Msk                      _UINT32_(0xF3FF030F)                                 /* (CFG_CFGPGQOS) Register Mask  */


/* -------- CFG_CFGPCLKGEN1 : (CFG Offset: 0x60) (R/W 32)  -------- */
#define CFG_CFGPCLKGEN1_RESETVALUE            _UINT32_(0x00)                                       /*  (CFG_CFGPCLKGEN1)   Reset Value */

