Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/zigbee/csc_sleep_touch/firmware/src/packs/WBZ351_DFP/component/cfg.h
#define CFG_CFGPCLKGEN3_TCC0CD(value)         (CFG_CFGPCLKGEN3_TCC0CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN3_TCC0CD_Pos)) /* Assigment of value for TCC0CD in the CFG_CFGPCLKGEN3 register */
#define   CFG_CFGPCLKGEN3_TCC0CD_ON_Val       _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN3) Enable PGCLK  */
#define   CFG_CFGPCLKGEN3_TCC0CD_OFF_Val      _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN3) Disable PGCLK  */
#define CFG_CFGPCLKGEN3_TCC0CD_ON             (CFG_CFGPCLKGEN3_TCC0CD_ON_Val << CFG_CFGPCLKGEN3_TCC0CD_Pos) /* (CFG_CFGPCLKGEN3) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN3_TCC0CD_OFF            (CFG_CFGPCLKGEN3_TCC0CD_OFF_Val << CFG_CFGPCLKGEN3_TCC0CD_Pos) /* (CFG_CFGPCLKGEN3) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN3_Msk                   _UINT32_(0x00FFFFFF)                                 /* (CFG_CFGPCLKGEN3) Register Mask  */


/* -------- CFG_CFGPCLKGEN4 : (CFG Offset: 0x90) (R/W 32)  -------- */
#define CFG_CFGPCLKGEN4_RESETVALUE            _UINT32_(0x00)                                       /*  (CFG_CFGPCLKGEN4)   Reset Value */

#define CFG_CFGPCLKGEN4_TC0CSEL_Pos           _UINT32_(0)                                          /* (CFG_CFGPCLKGEN4) TC0 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN4_TC0CSEL_Msk           (_UINT32_(0x7) << CFG_CFGPCLKGEN4_TC0CSEL_Pos)       /* (CFG_CFGPCLKGEN4) TC0 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN4_TC0CSEL(value)        (CFG_CFGPCLKGEN4_TC0CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC0CSEL_Pos)) /* Assigment of value for TC0CSEL in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC0CSEL_NO_CLK_Val  _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) No Clock  */
#define   CFG_CFGPCLKGEN4_TC0CSEL_REFO1_Val   _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 1  */
#define   CFG_CFGPCLKGEN4_TC0CSEL_REFO2_Val   _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 2  */
#define   CFG_CFGPCLKGEN4_TC0CSEL_REFO3_Val   _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 3  */
#define   CFG_CFGPCLKGEN4_TC0CSEL_REFO4_Val   _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 4  */
#define   CFG_CFGPCLKGEN4_TC0CSEL_REFO5_Val   _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 5  */
#define   CFG_CFGPCLKGEN4_TC0CSEL_REFO6_Val   _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 6  */
#define   CFG_CFGPCLKGEN4_TC0CSEL_LPCLK_Val   _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN4_TC0CSEL_NO_CLK        (CFG_CFGPCLKGEN4_TC0CSEL_NO_CLK_Val << CFG_CFGPCLKGEN4_TC0CSEL_Pos) /* (CFG_CFGPCLKGEN4) No Clock Position  */
#define CFG_CFGPCLKGEN4_TC0CSEL_REFO1         (CFG_CFGPCLKGEN4_TC0CSEL_REFO1_Val << CFG_CFGPCLKGEN4_TC0CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN4_TC0CSEL_REFO2         (CFG_CFGPCLKGEN4_TC0CSEL_REFO2_Val << CFG_CFGPCLKGEN4_TC0CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN4_TC0CSEL_REFO3         (CFG_CFGPCLKGEN4_TC0CSEL_REFO3_Val << CFG_CFGPCLKGEN4_TC0CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN4_TC0CSEL_REFO4         (CFG_CFGPCLKGEN4_TC0CSEL_REFO4_Val << CFG_CFGPCLKGEN4_TC0CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN4_TC0CSEL_REFO5         (CFG_CFGPCLKGEN4_TC0CSEL_REFO5_Val << CFG_CFGPCLKGEN4_TC0CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN4_TC0CSEL_REFO6         (CFG_CFGPCLKGEN4_TC0CSEL_REFO6_Val << CFG_CFGPCLKGEN4_TC0CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN4_TC0CSEL_LPCLK         (CFG_CFGPCLKGEN4_TC0CSEL_LPCLK_Val << CFG_CFGPCLKGEN4_TC0CSEL_Pos) /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN4_TC0CD_Pos             _UINT32_(3)                                          /* (CFG_CFGPCLKGEN4) TC0 Clock Disable Position */
#define CFG_CFGPCLKGEN4_TC0CD_Msk             (_UINT32_(0x1) << CFG_CFGPCLKGEN4_TC0CD_Pos)         /* (CFG_CFGPCLKGEN4) TC0 Clock Disable Mask */
#define CFG_CFGPCLKGEN4_TC0CD(value)          (CFG_CFGPCLKGEN4_TC0CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC0CD_Pos)) /* Assigment of value for TC0CD in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC0CD_ON_Val        _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Enable PGCLK  */
#define   CFG_CFGPCLKGEN4_TC0CD_OFF_Val       _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) Disable PGCLK  */
#define CFG_CFGPCLKGEN4_TC0CD_ON              (CFG_CFGPCLKGEN4_TC0CD_ON_Val << CFG_CFGPCLKGEN4_TC0CD_Pos) /* (CFG_CFGPCLKGEN4) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN4_TC0CD_OFF             (CFG_CFGPCLKGEN4_TC0CD_OFF_Val << CFG_CFGPCLKGEN4_TC0CD_Pos) /* (CFG_CFGPCLKGEN4) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN4_TC1CSEL_Pos           _UINT32_(4)                                          /* (CFG_CFGPCLKGEN4) TC1 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN4_TC1CSEL_Msk           (_UINT32_(0x7) << CFG_CFGPCLKGEN4_TC1CSEL_Pos)       /* (CFG_CFGPCLKGEN4) TC1 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN4_TC1CSEL(value)        (CFG_CFGPCLKGEN4_TC1CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC1CSEL_Pos)) /* Assigment of value for TC1CSEL in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC1CSEL_NO_CLK_Val  _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) No Clock  */
#define   CFG_CFGPCLKGEN4_TC1CSEL_REFO1_Val   _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 1  */
#define   CFG_CFGPCLKGEN4_TC1CSEL_REFO2_Val   _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 2  */
#define   CFG_CFGPCLKGEN4_TC1CSEL_REFO3_Val   _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 3  */
#define   CFG_CFGPCLKGEN4_TC1CSEL_REFO4_Val   _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 4  */
#define   CFG_CFGPCLKGEN4_TC1CSEL_REFO5_Val   _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 5  */
#define   CFG_CFGPCLKGEN4_TC1CSEL_REFO6_Val   _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 6  */
#define   CFG_CFGPCLKGEN4_TC1CSEL_LPCLK_Val   _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN4_TC1CSEL_NO_CLK        (CFG_CFGPCLKGEN4_TC1CSEL_NO_CLK_Val << CFG_CFGPCLKGEN4_TC1CSEL_Pos) /* (CFG_CFGPCLKGEN4) No Clock Position  */
#define CFG_CFGPCLKGEN4_TC1CSEL_REFO1         (CFG_CFGPCLKGEN4_TC1CSEL_REFO1_Val << CFG_CFGPCLKGEN4_TC1CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN4_TC1CSEL_REFO2         (CFG_CFGPCLKGEN4_TC1CSEL_REFO2_Val << CFG_CFGPCLKGEN4_TC1CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN4_TC1CSEL_REFO3         (CFG_CFGPCLKGEN4_TC1CSEL_REFO3_Val << CFG_CFGPCLKGEN4_TC1CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN4_TC1CSEL_REFO4         (CFG_CFGPCLKGEN4_TC1CSEL_REFO4_Val << CFG_CFGPCLKGEN4_TC1CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN4_TC1CSEL_REFO5         (CFG_CFGPCLKGEN4_TC1CSEL_REFO5_Val << CFG_CFGPCLKGEN4_TC1CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN4_TC1CSEL_REFO6         (CFG_CFGPCLKGEN4_TC1CSEL_REFO6_Val << CFG_CFGPCLKGEN4_TC1CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN4_TC1CSEL_LPCLK         (CFG_CFGPCLKGEN4_TC1CSEL_LPCLK_Val << CFG_CFGPCLKGEN4_TC1CSEL_Pos) /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN4_TC1CD_Pos             _UINT32_(7)                                          /* (CFG_CFGPCLKGEN4) TC1 Clock Disable Position */
#define CFG_CFGPCLKGEN4_TC1CD_Msk             (_UINT32_(0x1) << CFG_CFGPCLKGEN4_TC1CD_Pos)         /* (CFG_CFGPCLKGEN4) TC1 Clock Disable Mask */
#define CFG_CFGPCLKGEN4_TC1CD(value)          (CFG_CFGPCLKGEN4_TC1CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC1CD_Pos)) /* Assigment of value for TC1CD in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC1CD_ON_Val        _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Enable PGCLK  */
#define   CFG_CFGPCLKGEN4_TC1CD_OFF_Val       _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) Disable PGCLK  */
#define CFG_CFGPCLKGEN4_TC1CD_ON              (CFG_CFGPCLKGEN4_TC1CD_ON_Val << CFG_CFGPCLKGEN4_TC1CD_Pos) /* (CFG_CFGPCLKGEN4) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN4_TC1CD_OFF             (CFG_CFGPCLKGEN4_TC1CD_OFF_Val << CFG_CFGPCLKGEN4_TC1CD_Pos) /* (CFG_CFGPCLKGEN4) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN4_TC23CSEL_Pos          _UINT32_(8)                                          /* (CFG_CFGPCLKGEN4) TC23CSEL Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN4_TC23CSEL_Msk          (_UINT32_(0x7) << CFG_CFGPCLKGEN4_TC23CSEL_Pos)      /* (CFG_CFGPCLKGEN4) TC23CSEL Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN4_TC23CSEL(value)       (CFG_CFGPCLKGEN4_TC23CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC23CSEL_Pos)) /* Assigment of value for TC23CSEL in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC23CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) No Clock  */
#define   CFG_CFGPCLKGEN4_TC23CSEL_REFO1_Val  _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 1  */
#define   CFG_CFGPCLKGEN4_TC23CSEL_REFO2_Val  _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 2  */
#define   CFG_CFGPCLKGEN4_TC23CSEL_REFO3_Val  _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 3  */
#define   CFG_CFGPCLKGEN4_TC23CSEL_REFO4_Val  _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 4  */
#define   CFG_CFGPCLKGEN4_TC23CSEL_REFO5_Val  _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 5  */
#define   CFG_CFGPCLKGEN4_TC23CSEL_REFO6_Val  _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 6  */
#define   CFG_CFGPCLKGEN4_TC23CSEL_LPCLK_Val  _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN4_TC23CSEL_NO_CLK       (CFG_CFGPCLKGEN4_TC23CSEL_NO_CLK_Val << CFG_CFGPCLKGEN4_TC23CSEL_Pos) /* (CFG_CFGPCLKGEN4) No Clock Position  */
#define CFG_CFGPCLKGEN4_TC23CSEL_REFO1        (CFG_CFGPCLKGEN4_TC23CSEL_REFO1_Val << CFG_CFGPCLKGEN4_TC23CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN4_TC23CSEL_REFO2        (CFG_CFGPCLKGEN4_TC23CSEL_REFO2_Val << CFG_CFGPCLKGEN4_TC23CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN4_TC23CSEL_REFO3        (CFG_CFGPCLKGEN4_TC23CSEL_REFO3_Val << CFG_CFGPCLKGEN4_TC23CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN4_TC23CSEL_REFO4        (CFG_CFGPCLKGEN4_TC23CSEL_REFO4_Val << CFG_CFGPCLKGEN4_TC23CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN4_TC23CSEL_REFO5        (CFG_CFGPCLKGEN4_TC23CSEL_REFO5_Val << CFG_CFGPCLKGEN4_TC23CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN4_TC23CSEL_REFO6        (CFG_CFGPCLKGEN4_TC23CSEL_REFO6_Val << CFG_CFGPCLKGEN4_TC23CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN4_TC23CSEL_LPCLK        (CFG_CFGPCLKGEN4_TC23CSEL_LPCLK_Val << CFG_CFGPCLKGEN4_TC23CSEL_Pos) /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN4_TC23CD_Pos            _UINT32_(11)                                         /* (CFG_CFGPCLKGEN4) TC23CD Clock Disable Position */
#define CFG_CFGPCLKGEN4_TC23CD_Msk            (_UINT32_(0x1) << CFG_CFGPCLKGEN4_TC23CD_Pos)        /* (CFG_CFGPCLKGEN4) TC23CD Clock Disable Mask */
#define CFG_CFGPCLKGEN4_TC23CD(value)         (CFG_CFGPCLKGEN4_TC23CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC23CD_Pos)) /* Assigment of value for TC23CD in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC23CD_ON_Val       _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Enable PGCLK  */
#define   CFG_CFGPCLKGEN4_TC23CD_OFF_Val      _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) Disable PGCLK  */
#define CFG_CFGPCLKGEN4_TC23CD_ON             (CFG_CFGPCLKGEN4_TC23CD_ON_Val << CFG_CFGPCLKGEN4_TC23CD_Pos) /* (CFG_CFGPCLKGEN4) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN4_TC23CD_OFF            (CFG_CFGPCLKGEN4_TC23CD_OFF_Val << CFG_CFGPCLKGEN4_TC23CD_Pos) /* (CFG_CFGPCLKGEN4) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN4_TC54CSEL_Pos          _UINT32_(12)                                         /* (CFG_CFGPCLKGEN4) TC54CSEL Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN4_TC54CSEL_Msk          (_UINT32_(0x7) << CFG_CFGPCLKGEN4_TC54CSEL_Pos)      /* (CFG_CFGPCLKGEN4) TC54CSEL Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN4_TC54CSEL(value)       (CFG_CFGPCLKGEN4_TC54CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC54CSEL_Pos)) /* Assigment of value for TC54CSEL in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC54CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) No Clock  */
#define   CFG_CFGPCLKGEN4_TC54CSEL_REFO1_Val  _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 1  */
#define   CFG_CFGPCLKGEN4_TC54CSEL_REFO2_Val  _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 2  */
#define   CFG_CFGPCLKGEN4_TC54CSEL_REFO3_Val  _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 3  */
#define   CFG_CFGPCLKGEN4_TC54CSEL_REFO4_Val  _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 4  */
#define   CFG_CFGPCLKGEN4_TC54CSEL_REFO5_Val  _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 5  */
#define   CFG_CFGPCLKGEN4_TC54CSEL_REFO6_Val  _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 6  */
#define   CFG_CFGPCLKGEN4_TC54CSEL_LPCLK_Val  _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN4_TC54CSEL_NO_CLK       (CFG_CFGPCLKGEN4_TC54CSEL_NO_CLK_Val << CFG_CFGPCLKGEN4_TC54CSEL_Pos) /* (CFG_CFGPCLKGEN4) No Clock Position  */
#define CFG_CFGPCLKGEN4_TC54CSEL_REFO1        (CFG_CFGPCLKGEN4_TC54CSEL_REFO1_Val << CFG_CFGPCLKGEN4_TC54CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN4_TC54CSEL_REFO2        (CFG_CFGPCLKGEN4_TC54CSEL_REFO2_Val << CFG_CFGPCLKGEN4_TC54CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN4_TC54CSEL_REFO3        (CFG_CFGPCLKGEN4_TC54CSEL_REFO3_Val << CFG_CFGPCLKGEN4_TC54CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN4_TC54CSEL_REFO4        (CFG_CFGPCLKGEN4_TC54CSEL_REFO4_Val << CFG_CFGPCLKGEN4_TC54CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN4_TC54CSEL_REFO5        (CFG_CFGPCLKGEN4_TC54CSEL_REFO5_Val << CFG_CFGPCLKGEN4_TC54CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN4_TC54CSEL_REFO6        (CFG_CFGPCLKGEN4_TC54CSEL_REFO6_Val << CFG_CFGPCLKGEN4_TC54CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN4_TC54CSEL_LPCLK        (CFG_CFGPCLKGEN4_TC54CSEL_LPCLK_Val << CFG_CFGPCLKGEN4_TC54CSEL_Pos) /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN4_TC54CD_Pos            _UINT32_(15)                                         /* (CFG_CFGPCLKGEN4) TC54CD Clock Disable Position */
#define CFG_CFGPCLKGEN4_TC54CD_Msk            (_UINT32_(0x1) << CFG_CFGPCLKGEN4_TC54CD_Pos)        /* (CFG_CFGPCLKGEN4) TC54CD Clock Disable Mask */
#define CFG_CFGPCLKGEN4_TC54CD(value)         (CFG_CFGPCLKGEN4_TC54CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC54CD_Pos)) /* Assigment of value for TC54CD in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC54CD_ON_Val       _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Enable PGCLK  */
#define   CFG_CFGPCLKGEN4_TC54CD_OFF_Val      _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) Disable PGCLK  */
#define CFG_CFGPCLKGEN4_TC54CD_ON             (CFG_CFGPCLKGEN4_TC54CD_ON_Val << CFG_CFGPCLKGEN4_TC54CD_Pos) /* (CFG_CFGPCLKGEN4) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN4_TC54CD_OFF            (CFG_CFGPCLKGEN4_TC54CD_OFF_Val << CFG_CFGPCLKGEN4_TC54CD_Pos) /* (CFG_CFGPCLKGEN4) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN4_TC67CSEL_Pos          _UINT32_(16)                                         /* (CFG_CFGPCLKGEN4) TC67CSEL Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN4_TC67CSEL_Msk          (_UINT32_(0x7) << CFG_CFGPCLKGEN4_TC67CSEL_Pos)      /* (CFG_CFGPCLKGEN4) TC67CSEL Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN4_TC67CSEL(value)       (CFG_CFGPCLKGEN4_TC67CSEL_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC67CSEL_Pos)) /* Assigment of value for TC67CSEL in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC67CSEL_NO_CLK_Val _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) No Clock  */
#define   CFG_CFGPCLKGEN4_TC67CSEL_REFO1_Val  _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 1  */
#define   CFG_CFGPCLKGEN4_TC67CSEL_REFO2_Val  _UINT32_(0x2)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 2  */
#define   CFG_CFGPCLKGEN4_TC67CSEL_REFO3_Val  _UINT32_(0x3)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 3  */
#define   CFG_CFGPCLKGEN4_TC67CSEL_REFO4_Val  _UINT32_(0x4)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 4  */
#define   CFG_CFGPCLKGEN4_TC67CSEL_REFO5_Val  _UINT32_(0x5)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 5  */
#define   CFG_CFGPCLKGEN4_TC67CSEL_REFO6_Val  _UINT32_(0x6)                                        /* (CFG_CFGPCLKGEN4) Reference Clock 6  */
#define   CFG_CFGPCLKGEN4_TC67CSEL_LPCLK_Val  _UINT32_(0x7)                                        /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN4_TC67CSEL_NO_CLK       (CFG_CFGPCLKGEN4_TC67CSEL_NO_CLK_Val << CFG_CFGPCLKGEN4_TC67CSEL_Pos) /* (CFG_CFGPCLKGEN4) No Clock Position  */
#define CFG_CFGPCLKGEN4_TC67CSEL_REFO1        (CFG_CFGPCLKGEN4_TC67CSEL_REFO1_Val << CFG_CFGPCLKGEN4_TC67CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN4_TC67CSEL_REFO2        (CFG_CFGPCLKGEN4_TC67CSEL_REFO2_Val << CFG_CFGPCLKGEN4_TC67CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN4_TC67CSEL_REFO3        (CFG_CFGPCLKGEN4_TC67CSEL_REFO3_Val << CFG_CFGPCLKGEN4_TC67CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN4_TC67CSEL_REFO4        (CFG_CFGPCLKGEN4_TC67CSEL_REFO4_Val << CFG_CFGPCLKGEN4_TC67CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN4_TC67CSEL_REFO5        (CFG_CFGPCLKGEN4_TC67CSEL_REFO5_Val << CFG_CFGPCLKGEN4_TC67CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN4_TC67CSEL_REFO6        (CFG_CFGPCLKGEN4_TC67CSEL_REFO6_Val << CFG_CFGPCLKGEN4_TC67CSEL_Pos) /* (CFG_CFGPCLKGEN4) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN4_TC67CSEL_LPCLK        (CFG_CFGPCLKGEN4_TC67CSEL_LPCLK_Val << CFG_CFGPCLKGEN4_TC67CSEL_Pos) /* (CFG_CFGPCLKGEN4) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN4_TC67CD_Pos            _UINT32_(19)                                         /* (CFG_CFGPCLKGEN4) TC67CD Clock Disable Position */
#define CFG_CFGPCLKGEN4_TC67CD_Msk            (_UINT32_(0x1) << CFG_CFGPCLKGEN4_TC67CD_Pos)        /* (CFG_CFGPCLKGEN4) TC67CD Clock Disable Mask */
#define CFG_CFGPCLKGEN4_TC67CD(value)         (CFG_CFGPCLKGEN4_TC67CD_Msk & (_UINT32_(value) << CFG_CFGPCLKGEN4_TC67CD_Pos)) /* Assigment of value for TC67CD in the CFG_CFGPCLKGEN4 register */
#define   CFG_CFGPCLKGEN4_TC67CD_ON_Val       _UINT32_(0x1)                                        /* (CFG_CFGPCLKGEN4) Enable PGCLK  */
#define   CFG_CFGPCLKGEN4_TC67CD_OFF_Val      _UINT32_(0x0)                                        /* (CFG_CFGPCLKGEN4) Disable PGCLK  */
#define CFG_CFGPCLKGEN4_TC67CD_ON             (CFG_CFGPCLKGEN4_TC67CD_ON_Val << CFG_CFGPCLKGEN4_TC67CD_Pos) /* (CFG_CFGPCLKGEN4) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN4_TC67CD_OFF            (CFG_CFGPCLKGEN4_TC67CD_OFF_Val << CFG_CFGPCLKGEN4_TC67CD_Pos) /* (CFG_CFGPCLKGEN4) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN4_Msk                   _UINT32_(0x000FFFFF)                                 /* (CFG_CFGPCLKGEN4) Register Mask  */


/* -------- CFG_USER_ID : (CFG Offset: 0xA0) (R/W 32)  -------- */
#define CFG_USER_ID_RESETVALUE                _UINT32_(0x00)                                       /*  (CFG_USER_ID)   Reset Value */

#define CFG_USER_ID_USER_ID_Pos               _UINT32_(0)                                          /* (CFG_USER_ID) User unique ID, readable using the SWD USER_ID instruction Position */
#define CFG_USER_ID_USER_ID_Msk               (_UINT32_(0xFFFF) << CFG_USER_ID_USER_ID_Pos)        /* (CFG_USER_ID) User unique ID, readable using the SWD USER_ID instruction Mask */
#define CFG_USER_ID_USER_ID(value)            (CFG_USER_ID_USER_ID_Msk & (_UINT32_(value) << CFG_USER_ID_USER_ID_Pos)) /* Assigment of value for USER_ID in the CFG_USER_ID register */
#define CFG_USER_ID_Msk                       _UINT32_(0x0000FFFF)                                 /* (CFG_USER_ID) Register Mask  */


/* -------- CFG_SYSKEY : (CFG Offset: 0xB0) (R/W 32)  -------- */
#define CFG_SYSKEY_RESETVALUE                 _UINT32_(0x00)                                       /*  (CFG_SYSKEY)   Reset Value */

#define CFG_SYSKEY_SYSKEY_Pos                 _UINT32_(0)                                          /* (CFG_SYSKEY) System Key Position */
#define CFG_SYSKEY_SYSKEY_Msk                 (_UINT32_(0xFFFFFFFF) << CFG_SYSKEY_SYSKEY_Pos)      /* (CFG_SYSKEY) System Key Mask */
#define CFG_SYSKEY_SYSKEY(value)              (CFG_SYSKEY_SYSKEY_Msk & (_UINT32_(value) << CFG_SYSKEY_SYSKEY_Pos)) /* Assigment of value for SYSKEY in the CFG_SYSKEY register */
#define CFG_SYSKEY_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (CFG_SYSKEY) Register Mask  */


/* -------- CFG_PMD1 : (CFG Offset: 0xC0) (R/W 32)  -------- */
#define CFG_PMD1_RESETVALUE                   _UINT32_(0x00)                                       /*  (CFG_PMD1)   Reset Value */

