Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/zigbee/csc_sleep_touch/firmware/src/packs/WBZ351_DFP/component/cfg.h
#define CFG_PMD1_ZBMD_Pos                     _UINT32_(0)                                          /* (CFG_PMD1) ZigBee Module Disable Position */
#define CFG_PMD1_ZBMD_Msk                     (_UINT32_(0x1) << CFG_PMD1_ZBMD_Pos)                 /* (CFG_PMD1) ZigBee Module Disable Mask */
#define CFG_PMD1_ZBMD(value)                  (CFG_PMD1_ZBMD_Msk & (_UINT32_(value) << CFG_PMD1_ZBMD_Pos)) /* Assigment of value for ZBMD in the CFG_PMD1 register */
#define CFG_PMD1_BTMD_Pos                     _UINT32_(1)                                          /* (CFG_PMD1) Bluetooth Module Disable Position */
#define CFG_PMD1_BTMD_Msk                     (_UINT32_(0x1) << CFG_PMD1_BTMD_Pos)                 /* (CFG_PMD1) Bluetooth Module Disable Mask */
#define CFG_PMD1_BTMD(value)                  (CFG_PMD1_BTMD_Msk & (_UINT32_(value) << CFG_PMD1_BTMD_Pos)) /* Assigment of value for BTMD in the CFG_PMD1 register */
#define CFG_PMD1_MPAMD_Pos                    _UINT32_(2)                                          /* (CFG_PMD1) RF MPA Module Disable Position */
#define CFG_PMD1_MPAMD_Msk                    (_UINT32_(0x1) << CFG_PMD1_MPAMD_Pos)                /* (CFG_PMD1) RF MPA Module Disable Mask */
#define CFG_PMD1_MPAMD(value)                 (CFG_PMD1_MPAMD_Msk & (_UINT32_(value) << CFG_PMD1_MPAMD_Pos)) /* Assigment of value for MPAMD in the CFG_PMD1 register */
#define CFG_PMD1_LPAMD_Pos                    _UINT32_(3)                                          /* (CFG_PMD1) RF LPA Module Disable Position */
#define CFG_PMD1_LPAMD_Msk                    (_UINT32_(0x1) << CFG_PMD1_LPAMD_Pos)                /* (CFG_PMD1) RF LPA Module Disable Mask */
#define CFG_PMD1_LPAMD(value)                 (CFG_PMD1_LPAMD_Msk & (_UINT32_(value) << CFG_PMD1_LPAMD_Pos)) /* Assigment of value for LPAMD in the CFG_PMD1 register */
#define CFG_PMD1_PLVDMD_Pos                   _UINT32_(4)                                          /* (CFG_PMD1) PLVD Module Disable Position */
#define CFG_PMD1_PLVDMD_Msk                   (_UINT32_(0x1) << CFG_PMD1_PLVDMD_Pos)               /* (CFG_PMD1) PLVD Module Disable Mask */
#define CFG_PMD1_PLVDMD(value)                (CFG_PMD1_PLVDMD_Msk & (_UINT32_(value) << CFG_PMD1_PLVDMD_Pos)) /* Assigment of value for PLVDMD in the CFG_PMD1 register */
#define CFG_PMD1_ACMD_Pos                     _UINT32_(6)                                          /* (CFG_PMD1) AC Module Disable Position */
#define CFG_PMD1_ACMD_Msk                     (_UINT32_(0x1) << CFG_PMD1_ACMD_Pos)                 /* (CFG_PMD1) AC Module Disable Mask */
#define CFG_PMD1_ACMD(value)                  (CFG_PMD1_ACMD_Msk & (_UINT32_(value) << CFG_PMD1_ACMD_Pos)) /* Assigment of value for ACMD in the CFG_PMD1 register */
#define CFG_PMD1_ADCMD_Pos                    _UINT32_(7)                                          /* (CFG_PMD1) ADC Controller Module Disable Position */
#define CFG_PMD1_ADCMD_Msk                    (_UINT32_(0x1) << CFG_PMD1_ADCMD_Pos)                /* (CFG_PMD1) ADC Controller Module Disable Mask */
#define CFG_PMD1_ADCMD(value)                 (CFG_PMD1_ADCMD_Msk & (_UINT32_(value) << CFG_PMD1_ADCMD_Pos)) /* Assigment of value for ADCMD in the CFG_PMD1 register */
#define CFG_PMD1_ADCSARMD_Pos                 _UINT32_(8)                                          /* (CFG_PMD1) Shared ADC SAR Core Module Disable Position */
#define CFG_PMD1_ADCSARMD_Msk                 (_UINT32_(0x1) << CFG_PMD1_ADCSARMD_Pos)             /* (CFG_PMD1) Shared ADC SAR Core Module Disable Mask */
#define CFG_PMD1_ADCSARMD(value)              (CFG_PMD1_ADCSARMD_Msk & (_UINT32_(value) << CFG_PMD1_ADCSARMD_Pos)) /* Assigment of value for ADCSARMD in the CFG_PMD1 register */
#define CFG_PMD1_CVDMD_Pos                    _UINT32_(9)                                          /* (CFG_PMD1) Shared ADC SAR Core Module Disable Position */
#define CFG_PMD1_CVDMD_Msk                    (_UINT32_(0x1) << CFG_PMD1_CVDMD_Pos)                /* (CFG_PMD1) Shared ADC SAR Core Module Disable Mask */
#define CFG_PMD1_CVDMD(value)                 (CFG_PMD1_CVDMD_Msk & (_UINT32_(value) << CFG_PMD1_CVDMD_Pos)) /* Assigment of value for CVDMD in the CFG_PMD1 register */
#define CFG_PMD1_RTCCMD_Pos                   _UINT32_(16)                                         /* (CFG_PMD1) RTCC Module Disable Position */
#define CFG_PMD1_RTCCMD_Msk                   (_UINT32_(0x1) << CFG_PMD1_RTCCMD_Pos)               /* (CFG_PMD1) RTCC Module Disable Mask */
#define CFG_PMD1_RTCCMD(value)                (CFG_PMD1_RTCCMD_Msk & (_UINT32_(value) << CFG_PMD1_RTCCMD_Pos)) /* Assigment of value for RTCCMD in the CFG_PMD1 register */
#define CFG_PMD1_DGISPIMD_Pos                 _UINT32_(23)                                         /* (CFG_PMD1) DGI SPI Module Disable Position */
#define CFG_PMD1_DGISPIMD_Msk                 (_UINT32_(0x1) << CFG_PMD1_DGISPIMD_Pos)             /* (CFG_PMD1) DGI SPI Module Disable Mask */
#define CFG_PMD1_DGISPIMD(value)              (CFG_PMD1_DGISPIMD_Msk & (_UINT32_(value) << CFG_PMD1_DGISPIMD_Pos)) /* Assigment of value for DGISPIMD in the CFG_PMD1 register */
#define CFG_PMD1_QSPIMD_Pos                   _UINT32_(29)                                         /* (CFG_PMD1) SQI Module Disable Position */
#define CFG_PMD1_QSPIMD_Msk                   (_UINT32_(0x1) << CFG_PMD1_QSPIMD_Pos)               /* (CFG_PMD1) SQI Module Disable Mask */
#define CFG_PMD1_QSPIMD(value)                (CFG_PMD1_QSPIMD_Msk & (_UINT32_(value) << CFG_PMD1_QSPIMD_Pos)) /* Assigment of value for QSPIMD in the CFG_PMD1 register */
#define CFG_PMD1_Msk                          _UINT32_(0x208103DF)                                 /* (CFG_PMD1) Register Mask  */


/* -------- CFG_PMD2 : (CFG Offset: 0xD0) (R/W 32)  -------- */
#define CFG_PMD2_RESETVALUE                   _UINT32_(0x00)                                       /*  (CFG_PMD2)   Reset Value */

#define CFG_PMD2_REFO5MD_Pos                  _UINT32_(24)                                         /* (CFG_PMD2) Reference (Clock) Out 5 Module Disable Position */
#define CFG_PMD2_REFO5MD_Msk                  (_UINT32_(0x1) << CFG_PMD2_REFO5MD_Pos)              /* (CFG_PMD2) Reference (Clock) Out 5 Module Disable Mask */
#define CFG_PMD2_REFO5MD(value)               (CFG_PMD2_REFO5MD_Msk & (_UINT32_(value) << CFG_PMD2_REFO5MD_Pos)) /* Assigment of value for REFO5MD in the CFG_PMD2 register */
#define CFG_PMD2_REFO6MD_Pos                  _UINT32_(25)                                         /* (CFG_PMD2) Reference (Clock) Out 6 Module Disable Position */
#define CFG_PMD2_REFO6MD_Msk                  (_UINT32_(0x1) << CFG_PMD2_REFO6MD_Pos)              /* (CFG_PMD2) Reference (Clock) Out 6 Module Disable Mask */
#define CFG_PMD2_REFO6MD(value)               (CFG_PMD2_REFO6MD_Msk & (_UINT32_(value) << CFG_PMD2_REFO6MD_Pos)) /* Assigment of value for REFO6MD in the CFG_PMD2 register */
#define CFG_PMD2_REFO1MD_Pos                  _UINT32_(28)                                         /* (CFG_PMD2) Reference (Clock) Out 1 Module Disable Position */
#define CFG_PMD2_REFO1MD_Msk                  (_UINT32_(0x1) << CFG_PMD2_REFO1MD_Pos)              /* (CFG_PMD2) Reference (Clock) Out 1 Module Disable Mask */
#define CFG_PMD2_REFO1MD(value)               (CFG_PMD2_REFO1MD_Msk & (_UINT32_(value) << CFG_PMD2_REFO1MD_Pos)) /* Assigment of value for REFO1MD in the CFG_PMD2 register */
#define CFG_PMD2_REFO2MD_Pos                  _UINT32_(29)                                         /* (CFG_PMD2) Reference (Clock) Out 2 Module Disable Position */
#define CFG_PMD2_REFO2MD_Msk                  (_UINT32_(0x1) << CFG_PMD2_REFO2MD_Pos)              /* (CFG_PMD2) Reference (Clock) Out 2 Module Disable Mask */
#define CFG_PMD2_REFO2MD(value)               (CFG_PMD2_REFO2MD_Msk & (_UINT32_(value) << CFG_PMD2_REFO2MD_Pos)) /* Assigment of value for REFO2MD in the CFG_PMD2 register */
#define CFG_PMD2_REFO3MD_Pos                  _UINT32_(30)                                         /* (CFG_PMD2) Reference (Clock) Out 3 Module Disable Position */
#define CFG_PMD2_REFO3MD_Msk                  (_UINT32_(0x1) << CFG_PMD2_REFO3MD_Pos)              /* (CFG_PMD2) Reference (Clock) Out 3 Module Disable Mask */
#define CFG_PMD2_REFO3MD(value)               (CFG_PMD2_REFO3MD_Msk & (_UINT32_(value) << CFG_PMD2_REFO3MD_Pos)) /* Assigment of value for REFO3MD in the CFG_PMD2 register */
#define CFG_PMD2_REFO4MD_Pos                  _UINT32_(31)                                         /* (CFG_PMD2) Reference (Clock) Out 4 Module Disable Position */
#define CFG_PMD2_REFO4MD_Msk                  (_UINT32_(0x1) << CFG_PMD2_REFO4MD_Pos)              /* (CFG_PMD2) Reference (Clock) Out 4 Module Disable Mask */
#define CFG_PMD2_REFO4MD(value)               (CFG_PMD2_REFO4MD_Msk & (_UINT32_(value) << CFG_PMD2_REFO4MD_Pos)) /* Assigment of value for REFO4MD in the CFG_PMD2 register */
#define CFG_PMD2_Msk                          _UINT32_(0xF3000000)                                 /* (CFG_PMD2) Register Mask  */


