Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/zigbee/csc_sleep_touch/firmware/src/packs/WBZ351_DFP/component/cfg.h
/* -------- CFG_PMD3 : (CFG Offset: 0xE0) (R/W 32)  -------- */
#define CFG_PMD3_RESETVALUE                   _UINT32_(0x00)                                       /*  (CFG_PMD3)   Reset Value */

#define CFG_PMD3_SER0MD_Pos                   _UINT32_(0)                                          /* (CFG_PMD3) SERCOM0 Module Disable Position */
#define CFG_PMD3_SER0MD_Msk                   (_UINT32_(0x1) << CFG_PMD3_SER0MD_Pos)               /* (CFG_PMD3) SERCOM0 Module Disable Mask */
#define CFG_PMD3_SER0MD(value)                (CFG_PMD3_SER0MD_Msk & (_UINT32_(value) << CFG_PMD3_SER0MD_Pos)) /* Assigment of value for SER0MD in the CFG_PMD3 register */
#define CFG_PMD3_SER1MD_Pos                   _UINT32_(1)                                          /* (CFG_PMD3) SERCOM1 Module Disable Position */
#define CFG_PMD3_SER1MD_Msk                   (_UINT32_(0x1) << CFG_PMD3_SER1MD_Pos)               /* (CFG_PMD3) SERCOM1 Module Disable Mask */
#define CFG_PMD3_SER1MD(value)                (CFG_PMD3_SER1MD_Msk & (_UINT32_(value) << CFG_PMD3_SER1MD_Pos)) /* Assigment of value for SER1MD in the CFG_PMD3 register */
#define CFG_PMD3_SER2MD_Pos                   _UINT32_(2)                                          /* (CFG_PMD3) SERCOM2 Module Disable Position */
#define CFG_PMD3_SER2MD_Msk                   (_UINT32_(0x1) << CFG_PMD3_SER2MD_Pos)               /* (CFG_PMD3) SERCOM2 Module Disable Mask */
#define CFG_PMD3_SER2MD(value)                (CFG_PMD3_SER2MD_Msk & (_UINT32_(value) << CFG_PMD3_SER2MD_Pos)) /* Assigment of value for SER2MD in the CFG_PMD3 register */
#define CFG_PMD3_DACMD_Pos                    _UINT32_(3)                                          /* (CFG_PMD3) DAC Module Disable Position */
#define CFG_PMD3_DACMD_Msk                    (_UINT32_(0x1) << CFG_PMD3_DACMD_Pos)                /* (CFG_PMD3) DAC Module Disable Mask */
#define CFG_PMD3_DACMD(value)                 (CFG_PMD3_DACMD_Msk & (_UINT32_(value) << CFG_PMD3_DACMD_Pos)) /* Assigment of value for DACMD in the CFG_PMD3 register */
#define CFG_PMD3_TC0MD_Pos                    _UINT32_(4)                                          /* (CFG_PMD3) TC0 Module Disable Position */
#define CFG_PMD3_TC0MD_Msk                    (_UINT32_(0x1) << CFG_PMD3_TC0MD_Pos)                /* (CFG_PMD3) TC0 Module Disable Mask */
#define CFG_PMD3_TC0MD(value)                 (CFG_PMD3_TC0MD_Msk & (_UINT32_(value) << CFG_PMD3_TC0MD_Pos)) /* Assigment of value for TC0MD in the CFG_PMD3 register */
#define CFG_PMD3_TC1MD_Pos                    _UINT32_(5)                                          /* (CFG_PMD3) TC1 Module Disable Position */
#define CFG_PMD3_TC1MD_Msk                    (_UINT32_(0x1) << CFG_PMD3_TC1MD_Pos)                /* (CFG_PMD3) TC1 Module Disable Mask */
#define CFG_PMD3_TC1MD(value)                 (CFG_PMD3_TC1MD_Msk & (_UINT32_(value) << CFG_PMD3_TC1MD_Pos)) /* Assigment of value for TC1MD in the CFG_PMD3 register */
#define CFG_PMD3_TC2MD_Pos                    _UINT32_(6)                                          /* (CFG_PMD3) TC2 Module Disable Position */
#define CFG_PMD3_TC2MD_Msk                    (_UINT32_(0x1) << CFG_PMD3_TC2MD_Pos)                /* (CFG_PMD3) TC2 Module Disable Mask */
#define CFG_PMD3_TC2MD(value)                 (CFG_PMD3_TC2MD_Msk & (_UINT32_(value) << CFG_PMD3_TC2MD_Pos)) /* Assigment of value for TC2MD in the CFG_PMD3 register */
#define CFG_PMD3_TC3MD_Pos                    _UINT32_(7)                                          /* (CFG_PMD3) TC3 Module Disable Position */
#define CFG_PMD3_TC3MD_Msk                    (_UINT32_(0x1) << CFG_PMD3_TC3MD_Pos)                /* (CFG_PMD3) TC3 Module Disable Mask */
#define CFG_PMD3_TC3MD(value)                 (CFG_PMD3_TC3MD_Msk & (_UINT32_(value) << CFG_PMD3_TC3MD_Pos)) /* Assigment of value for TC3MD in the CFG_PMD3 register */
#define CFG_PMD3_TC4MD_Pos                    _UINT32_(8)                                          /* (CFG_PMD3) TC4 Module Disable Position */
#define CFG_PMD3_TC4MD_Msk                    (_UINT32_(0x1) << CFG_PMD3_TC4MD_Pos)                /* (CFG_PMD3) TC4 Module Disable Mask */
#define CFG_PMD3_TC4MD(value)                 (CFG_PMD3_TC4MD_Msk & (_UINT32_(value) << CFG_PMD3_TC4MD_Pos)) /* Assigment of value for TC4MD in the CFG_PMD3 register */
#define CFG_PMD3_TC5MD_Pos                    _UINT32_(9)                                          /* (CFG_PMD3) TC5 Module Disable Position */
#define CFG_PMD3_TC5MD_Msk                    (_UINT32_(0x1) << CFG_PMD3_TC5MD_Pos)                /* (CFG_PMD3) TC5 Module Disable Mask */
#define CFG_PMD3_TC5MD(value)                 (CFG_PMD3_TC5MD_Msk & (_UINT32_(value) << CFG_PMD3_TC5MD_Pos)) /* Assigment of value for TC5MD in the CFG_PMD3 register */
#define CFG_PMD3_TC6MD_Pos                    _UINT32_(10)                                         /* (CFG_PMD3) TC6 Module Disable Position */
#define CFG_PMD3_TC6MD_Msk                    (_UINT32_(0x1) << CFG_PMD3_TC6MD_Pos)                /* (CFG_PMD3) TC6 Module Disable Mask */
#define CFG_PMD3_TC6MD(value)                 (CFG_PMD3_TC6MD_Msk & (_UINT32_(value) << CFG_PMD3_TC6MD_Pos)) /* Assigment of value for TC6MD in the CFG_PMD3 register */
#define CFG_PMD3_TC7MD_Pos                    _UINT32_(11)                                         /* (CFG_PMD3) TC7 Module Disable Position */
#define CFG_PMD3_TC7MD_Msk                    (_UINT32_(0x1) << CFG_PMD3_TC7MD_Pos)                /* (CFG_PMD3) TC7 Module Disable Mask */
#define CFG_PMD3_TC7MD(value)                 (CFG_PMD3_TC7MD_Msk & (_UINT32_(value) << CFG_PMD3_TC7MD_Pos)) /* Assigment of value for TC7MD in the CFG_PMD3 register */
#define CFG_PMD3_TCC0MD_Pos                   _UINT32_(12)                                         /* (CFG_PMD3) TCC0 Module Disable Position */
#define CFG_PMD3_TCC0MD_Msk                   (_UINT32_(0x1) << CFG_PMD3_TCC0MD_Pos)               /* (CFG_PMD3) TCC0 Module Disable Mask */
#define CFG_PMD3_TCC0MD(value)                (CFG_PMD3_TCC0MD_Msk & (_UINT32_(value) << CFG_PMD3_TCC0MD_Pos)) /* Assigment of value for TCC0MD in the CFG_PMD3 register */
#define CFG_PMD3_TCC1MD_Pos                   _UINT32_(13)                                         /* (CFG_PMD3) TCC1 Module Disable Position */
#define CFG_PMD3_TCC1MD_Msk                   (_UINT32_(0x1) << CFG_PMD3_TCC1MD_Pos)               /* (CFG_PMD3) TCC1 Module Disable Mask */
#define CFG_PMD3_TCC1MD(value)                (CFG_PMD3_TCC1MD_Msk & (_UINT32_(value) << CFG_PMD3_TCC1MD_Pos)) /* Assigment of value for TCC1MD in the CFG_PMD3 register */
#define CFG_PMD3_TCC2MD_Pos                   _UINT32_(14)                                         /* (CFG_PMD3) TCC2 Module Disable Position */
#define CFG_PMD3_TCC2MD_Msk                   (_UINT32_(0x1) << CFG_PMD3_TCC2MD_Pos)               /* (CFG_PMD3) TCC2 Module Disable Mask */
#define CFG_PMD3_TCC2MD(value)                (CFG_PMD3_TCC2MD_Msk & (_UINT32_(value) << CFG_PMD3_TCC2MD_Pos)) /* Assigment of value for TCC2MD in the CFG_PMD3 register */
#define CFG_PMD3_Msk                          _UINT32_(0x00007FFF)                                 /* (CFG_PMD3) Register Mask  */


/* -------- CFG_MISCSTAT : (CFG Offset: 0x100) (R/W 32)  -------- */
#define CFG_MISCSTAT_RESETVALUE               _UINT32_(0x1000081)                                  /*  (CFG_MISCSTAT)   Reset Value */

#define CFG_MISCSTAT_CLDORDY_Pos              _UINT32_(9)                                          /* (CFG_MISCSTAT) CLDO Ready Position */
#define CFG_MISCSTAT_CLDORDY_Msk              (_UINT32_(0x1) << CFG_MISCSTAT_CLDORDY_Pos)          /* (CFG_MISCSTAT) CLDO Ready Mask */
#define CFG_MISCSTAT_CLDORDY(value)           (CFG_MISCSTAT_CLDORDY_Msk & (_UINT32_(value) << CFG_MISCSTAT_CLDORDY_Pos)) /* Assigment of value for CLDORDY in the CFG_MISCSTAT register */
#define CFG_MISCSTAT_Msk                      _UINT32_(0x00000200)                                 /* (CFG_MISCSTAT) Register Mask  */


/* -------- CFG_ID : (CFG Offset: 0x140) ( R/ 32) Device ID -------- */
#define CFG_ID_RESETVALUE                     _UINT32_(0x00)                                       /*  (CFG_ID) Device ID  Reset Value */

#define CFG_ID_Msk                            _UINT32_(0x00000000)                                 /* (CFG_ID) Register Mask  */


/* -------- CFG_BCFG0 : (CFG Offset: 0x200) ( R/ 32)  -------- */
#define CFG_BCFG0_RESETVALUE                  _UINT32_(0x00)                                       /*  (CFG_BCFG0)   Reset Value */

